In [2]:
# dataframe
import pandas as pd
s_id= pd.Series(["01","02","03","04","05"])
s_class = pd.Series(["二班","一班","二班","三班","一班"])
s_grade=pd.Series([92,67,70,88,76])
df1=pd.DataFrame({"学号":s_id,"班级":s_class,"成绩":s_grade})
# 列名 series 列名 series
df1

   学号  班级  成绩
0  01  二班  92
1  02  一班  67
2  03  二班  70
3  04  三班  88
4  05  一班  76

In [4]:
df1=pd.DataFrame({"学号":{"小明":"01"},
                  "班级":{"小明":"二班"},
                  "成绩":{"小明":92}
                 })
df1

    学号  班级  成绩
小明  01  二班  92

In [5]:
# 获取dataframe索引和列名
df1.index

Index(['小明'], dtype='object')

In [6]:
df1.columns

Index(['学号', '班级', '成绩'], dtype='object')

In [7]:
df1.values

array([['01', '二班', 92]], dtype=object)

In [8]:
# 把行和列进行转置
df1.T

    小明
学号  01
班级  二班
成绩  92

In [9]:
# 把列名对应的列的数据提取出来
df1['班级']

小明    二班
Name: 班级, dtype: object

In [10]:
df1['成绩']

小明    92
Name: 成绩, dtype: int64

In [11]:
df1.班级

小明    二班
Name: 班级, dtype: object

In [12]:
df1[["学号","成绩"]]

    学号  成绩
小明  01  92

In [13]:
# 提取行用索引
df1.loc["小明"]

学号    01
班级    二班
成绩    92
Name: 小明, dtype: object

In [14]:
df1.iloc[0]

学号    01
班级    二班
成绩    92
Name: 小明, dtype: object

In [15]:
df1.loc["小明","学号"]

'01'

In [19]:
df1.loc["小明":"小杰","班级":"成绩"]

    班级  成绩
小明  二班  92

In [20]:
# 根据条件筛选
df1[df1["成绩"]>80]
df1[df1.成绩>80]

    学号  班级  成绩
小明  01  二班  92

In [27]:
df1[(df1["成绩"]>80)& (df1["班级"]=="二班")]

    学号  班级  成绩
小明  01  二班  92

In [28]:
# head返回dataframe返回前五行
df1.head()

    学号  班级  成绩
小明  01  二班  92

In [29]:
df1.head(4)

    学号  班级  成绩
小明  01  二班  92